# თუ დასაინსტალირებელია ბიბლიოთეკები, დიეზი მოუხსენი 'install.packages' კოდს და თუნდაც მარტო ის ხაზი მონიშნე და გაუშვი. 
# ერთხელ დაინსტალირებაა საკმარისი და შემდეგ მუდამ ხელმისაწვდომი იქნება.
#install.packages("ggplot2")
#install.packages("RSQLite")

#საჭიროა ბიბლიოთეკის გამოცხადება ყველა სკრიპტში, სადაც ამ ბიბლიოთეკას ვიყენებთ.
library("RSQLite")
library("ggplot2")

#ეს ბრძანება სავარაუდოდ ეძებს .db (DataBase) ფაილებს, SQLite-ის ფაილი რომ იპოვოს, სავარაუდოდ. დატოვეთ უცვლელად.
system("ls *.db", show=TRUE)

#SQLite არის ლოკალური მონაცემთა ბაზების ერთერთი სისტემა. მისი ბიბლიოთეკის ჩატვირთვის შემდეგ უკვე შეგვიძლია ამ ტიპის ბაზას დავუკავშრდეთ:
sqlite    = dbDriver("SQLite")

#RSQLite ბიბლიოთეკის dbConnect ბრძანებით ხდება ბაზასთან დაკავშირება. ბაზის ფაილის მისამართი ჩემ შემთხვევაშია D ლოკალურ დისკზე. 
# სადაც იქნება თქვენი ფაილი(რომლის ლინკიც სკაიპში მოგწერეთ), ის მდებარეობა მიუთითეთ. საქაღალდეები უნდა 
#   გამოიყოს ორი -ზედა მარცხნიდან-ქვედა მარჯვნივ- დახრილი ხაზით, ან ერთი -ქვედა მარცხნიდან-ზედა მარჯვნივ- დახრილი ხაზით.
exampledb = dbConnect(sqlite,"D:\\database.sqlite")

#RSQLite ბიბლიოთეკის dbListTables ბრძანებით ვნახავთ მონაცემთა ბაზაში რა ცხრილები გვაქვს(ამ შემთხვევაში მხოლოდ ერთი ცხრილია, loans):
dbListTables(exampledb)

#RSQLite ბიბლიოთეკის dbListFields ბრძანებით ვნახავთ კონკრეტულ ცხრილში რა ველებია:
dbListFields(exampledb, "loan")

#RSQLite ბიბლიოთეკის dbSendQuery ბრძანებით შეგვიძლია SQLite ენაზე დაწერილი ბრძანება გავუშვათ, ამ შემთხვევაში, - გვაჩვენოს პირველი 1000 სესხი.
#ამ შემთხვევაში, results ცვლადს მიენიჭა არა უშუალოდ მონაცემები, არამედ მონაცემების გამოტანის ბრძანება,
#რომელებსაც რეალურად ვერ გამოვიყენებთ, სანამ მას data.frame სახეს არ მივცემთ 
results = dbSendQuery(exampledb, 
                      "select * from loan limit 1000")

#res ცვლადში ვახდენთ results ბრძანების შედეგების ჩაყრას fetch-ით და მისთვის data.frame სახის მიცემას.
#მეორე პარამეტრი სადაც 1000 წერია, მიუთითებს რამდენი ჩანაწერი ანუ Row გვინდა რომ წამოვიღოთ.
res = data.frame(fetch(results,1000))

#ამ ბრძანებით ვფილტრავთ და მოგვაქვს მხოლოდ პირველი 20 ველი ანუ Column-ი.
res = res[, 1:20]

#ამ ბრძანებით შესაძლებელია საბსეტის გაკეთება.
#მეორე პარამეტრში წერია ჩანაწერების ფილტრი, ანუ წამოიღოს ჩანაწერები, რომლის loan_status არის Current ან 1 = 1. 
# 1 = 1 პირობა ყოველთვის ჭეშმარიტია, ამიტომ ყველა ჩანაწერს წამოიღებს და არაფერიც არ გაიფილტრება :-) 
# ფილტრში "ან" ოპერატორი იწერება ასე: | 
# ფილტრში "და" ოპერატორი იწერება ასე: &
res = subset(res, res$loan_status == "Current" | 1 == 1)

qplot(data = res, x = res$loan_amnt, y = res$int_rate, color=res$grade, ylab = "რაოდენობა", xlab = "სესხის მოცულობა", main="ჩვენი ჩარტი")



#თუ ფაილის შენახვისას მოგთხოვათ ფაილის ენკოდინგი ამოირჩიეთო, UTF-8 უნდა მიუთითოთ.



